## Pandas
### Missing Date

In [4]:
import pandas as pd
import numpy as np

In [6]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df.dropna() # row without a nan value

     A    B  C
0  1.0  5.0  1

In [11]:
df.dropna(axis=1)# columns without a nan value

   C
0  1
1  2
2  3

In [15]:
df.dropna(thresh=2) # number of nan values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [16]:
df.fillna(value='Fill Value') # set value in nan

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [20]:
df['A'].fillna(value=df.A.mean()) # change nan value

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64